# SpaceSeparationLinesOverlap Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..OverlapFailures..::..SpaceSeparationLinesOverlap Property
BuiltInFailures..::..OverlapFailures Class See Also
---
Highlighted space separation lines overlap. One of them may be ignored when Revit finds space boundaries. Delete one of the lines.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId SpaceSeparationLinesOverlap { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SpaceSeparationLinesOverlap As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ SpaceSeparationLinesOverlap {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..OverlapFailures Class
Autodesk.Revit.DB Namespace